app/record/lists/common/sample.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="urn:platform_2018_1.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2018_1.platform.webservices.netsuite.com" xmlns:platformFaults="urn:faults_2018_1.platform.webservices.netsuite.com" xmlns:actSched="urn:scheduling_2018_1.activities.webservices.netsuite.com" xmlns:fileCabinet="urn:filecabinet_2018_1.documents.webservices.netsuite.com" xmlns:listAcct="urn:accounting_2018_1.lists.webservices.netsuite.com" xmlns:listEmp="urn:employees_2018_1.lists.webservices.netsuite.com" xmlns:listMkt="urn:marketing_2018_1.lists.webservices.netsuite.com" xmlns:listRel="urn:relationships_2018_1.lists.webservices.netsuite.com" xmlns:listSupport="urn:support_2018_1.lists.webservices.netsuite.com" xmlns:listWebsite="urn:website_2018_1.lists.webservices.netsuite.com" xmlns:platformCommon="urn:common_2018_1.platform.webservices.netsuite.com" xmlns:platformCore="urn:core_2018_1.platform.webservices.netsuite.com" xmlns:setupCustom="urn:customization_2018_1.setup.webservices.netsuite.com" xmlns:tranBank="urn:bank_2018_1.transactions.webservices.netsuite.com" xmlns:tranCust="urn:customers_2018_1.transactions.webservices.netsuite.com" xmlns:tranGeneral="urn:general_2018_1.transactions.webservices.netsuite.com" xmlns:tranInvt="urn:inventory_2018_1.transactions.webservices.netsuite.com" xmlns:tranSales="urn:sales_2018_1.transactions.webservices.netsuite.com"><soap:Header><platformMsgs:tokenPassport><platformCore:account>5446511_SB2</platformCore:account><platformCore:consumerKey>06b3c9100b94787541047b40aebf67041bb77253c48a84d7a3dfea2142322abd</platformCore:consumerKey><platformCore:nonce>gq444ytbbhtn68effd5e7c</platformCore:nonce><platformCore:timestamp>1591803410</platformCore:timestamp><platformCore:token>2491612e12e0e897ec060202f5236e0fd6df8fc6f4394942258521be233741b3</platformCore:token><platformCore:version>1.0</platformCore:version><platformCore:signature algorithm="HMAC_SHA256">MTO48HLJECqMKJ+jfTeDnJENwCfbF052o5ZpCk82cBs=</platformCore:signature></platformMsgs:tokenPassport></soap:Header><soap:Body><platformMsgs:add xmlns:platformMsgs="urn:messages_2018_1.platform.webservices.netsuite.com" xmlns="urn:messages_2018_1.platform.webservices.netsuite.com"><tranSales:record xsi:type="tranSales:Estimate"><tranSales:tranDate>2020-06-10T15:36:49.984Z</tranSales:tranDate><tranSales:expectedCloseDate>2020-07-10T15:36:49.984Z</tranSales:expectedCloseDate><tranSales:dueDate>2020-07-10T15:36:49.984Z</tranSales:dueDate><tranSales:entity internalId="2691" type="customer" xsi:type="platformCore:RecordRef"></tranSales:entity><platformMsgs:tranSales:itemList><tranSales:item xsi:type="tranSales:EstimateItem"><tranSales:item
externalId="1484985" type="inventoryItem" xsi:type="platformCore:RecordRef"></tranSales:item></tranSales:item><tranSales:item xsi:type="tranSales:EstimateItem"><tranSales:item externalId="1614455" type="inventoryItem" xsi:type="platformCore:RecordRef"></tranSales:item></tranSales:item></platformMsgs:tranSales:itemList><tranSales:customFieldList><platformCore:customField xsi:type="platformCore:StringCustomFieldRef" scriptId="custbody_rs_bc_quotenumber" ><platformCore:value>3</platformCore:value></platformCore:customField></tranSales:customFieldList></tranSales:record></platformMsgs:add></soap:Body></soap:Envelope>